/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ghiblirc_default.h                                 :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yben-dje <yben-dje@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/04/21 15:32:02 by yben-dje          #+#    #+#             */
/*   Updated: 2026/04/23 14:37:28 by yben-dje         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef GHIBLIRC_DEFAULT_H
# define GHIBLIRC_DEFAULT_H

//  ======== DO NOT AUTOMATICALLY FORMAT THIS FILE !!! ========

# define GHIBLIRC_DEFAULT "echo '                   \
                            \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⢧⠀⠀⠀⠀⠀⠀⢀⣾⠇⢸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⠛⢸⡄⠀⠀⠀⠀⢠⡟⠁⠀⠸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⢠⣆⡾⣆⠀⠀⠀⠀⠀⠀⢀⡾⠇⠀⠸⡇⠀⠀⠀⢠⡟⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⢸⣘⣿⢹⣆⠀⠀⠀⠀⠀⣼⠷⠀⠀⠀⣷⠀⠀⢀⡞⠃⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⢨⣿⠟⠀⠛⢷⡄⠀⠀⢠⣯⠁⠀⠀⠀⣿⠀⢄⣾⠃⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⣼⣽⣿⡄⠀⠈⠻⣦⡈⢻⣿⡇⠀⣴⣾⠙⢀⣝⢯⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⢹⠙⠉⠀⠀⠀⠀⢘⣾⣬⡿⠧⠴⠿⠿⢤⣵⣿⣿⣿⠆⠀⣤⣴⣶⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⢹⡀⢀⣠⡴⠖⠋⠉⠀⠀⠁⠀⠀⠀⠀⠀⠀⠻⠿⠛⠀⢠⣿⣿⣿⠶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⣠⣶⠗⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠉⠙⠲⢶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⣰⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⢹⣧⡄⠀⠀⠀⠀⠀⠀⠀⠀'\n\
echo '                                               \
                                           ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⣼⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣄⠀⠀⠀⠀⠀⠀⠀'\n\
echo '   /OOOOOO  /OO       /OO /OO       /OO /OO  /O\
OOOOO  /OO                 /OO /OO        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\
⠀⢠⣿⣄⠀⠀⢀⣾⣿⠛⢶⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣅⡀⠀⠀⠀⠀⠀'\n\
echo '  /OO__  OO| OO      |__/| OO      | OO|__/ /OO\
__  OO| OO                | OO| OO        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶\
⣿⢿⣟⠉⠁⠀⢼⣿⣧⠀⠈⣇⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⡇⠀⠀⠀⠀⠀'\n\
echo ' | OO  \\\\__/| OOOOOOO  /OO| OOOOOOO | OO /OO|\
 OO  \\\\__/| OOOOOOO   /OOOOOO | OO| OO        ⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⣿⡟⠻⠈⠉⠀⠀⠀⠈⠳⠤⠴⠚⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⡀⠀⠀⠀⠀'\n\
echo ' | OO /OOOO| OO__  OO| OO| OO__  OO| OO| OO|  O\
OOOOO | OO__  OO /OO__  OO| OO| OO        ⠀⠀⠀⠀⠀⠀⠀⣈⣹⡟⠀\
⠀⠀⠀⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢧⠀⠀⠀⠀'\n\
echo ' | OO|_  OO| OO  \\\\ OO| OO| OO  \\\\ OO| OO| \
OO \\\\____  OO| OO  \\\\ OO| OOOOOOOO| OO| OO       \
 ⠀⠀⠀⠀⠀⠀⠙⠩⢼⡆⠀⠀⠀⠀⠀⠀⠰⢶⣤⣽⣍⣏⣉⠽⠛⠓⠒⠲⠦⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣇⠀⠀⠀'\n\
echo ' | OO  \\\\ OO| OO  | OO| OO| OO  | OO| OO| OO \
/OO  \\\\ OO| OO  | OO| OO_____/| OO| OO        ⠀⠀⠀⠀⠀\
⠀⠀⢀⣬⠿⠃⠀⠀⠀⠀⠀⠀⠀⢢⣐⡚⠏⠝⠛⠿⢶⣦⣤⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀'\n\
echo ' |  OOOOOO/| OO  | OO| OO| OOOOOOO/| OO| OO|  O\
OOOOO/| OO  | OO|  OOOOOOO| OO| OO        ⠀⠀⠀⠀⠀⠀⣠⣾⣯⠤⣤\
⣀⡀⠀⠀⠀⠀⠀⠈⠙⠛⠷⢶⣤⣈⢀⠂⠀⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣦⠀⠀'\n\
echo '  \\\\______/ |__/  |__/|__/|_______/ |__/|__/ \
\\\\______/ |__/  |__/ \\\\_______/|__/|__/        ⠀⠀\
⠀⠀⣠⡾⠋⠁⠀⠀⠀⠀⠉⠳⢤⣀⠀⠀⠀⠀⠀⠀⠀⠈⠹⠓⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣧⠀'\n\
echo '                                               \
                                          ⠀⠀⣠⣾⠏⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠛⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡧'\n\
echo '                                               \
                                          ⣀⣰⣿⣥⡀⠀⠀⠀⠀⠀⠀\
⠀⠀⠀⠀⠀⠀⣘⣧⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⣿\\n'\n\
export PROMPT='GhibliShell @u\\@@l > '"

# define GHIBLIRC_SETUP_PROMPT "It seems like there is no .ghiblirc file \
in your home directory.\n\
You have 3 available options:\n\
    (1) Create and add the default template to the .ghiblirc file. \n\
    (2) Create an empty .ghiblirc file.\n\
    (3) Ignore (This will be reprompted the next time you open Ghiblishell)\n\n\
If you hesitate, take a breath, go outside touch some grass\n\
(Just kidding, don't do that), and remember that this choice is\n\
less important than the dilem given by the grand father to\n\
Mahito at the end of How Do You Live?.\n\n"

#endif